app/Controllers/CustomerController.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $data['customers'] = $this->customer->findAll();

INSERT INTO `customers` (`name`, `email`, `phone_Number`, `address`, `state`, `created_at`, `details`) VALUES ('khayrul Alam Rayan', 'rayan@gmail.com', '0215478', NULL, 'dddddd', '2023-12-21', NULL)
---
   public function store(){
    $data = [
        'name'=>$this->request->getVar('name'),
        'email'=>$this->request->getVar('email'),
        'phone_Number'=>$this->request->getVar('phone'),
        'address' =>$this->request->getVar('address'),
        'state' =>$this->request->getVar('state'),
        'created_at' =>$this->request->getVar('date'),
        'details' =>$this->request->getVar('subject'),
    ];
    // print_r($data);
    $rules= [
        'name' => 'required|max_length[100]|min_length[3]',
       //  'description' => 'required|max_length[250]|min_length[10]',
       // 'price' => 'required|numeric',
       // // 'image' => 'uploaded[image]|max_size[image,102400]|ext_in[image,jpg,jpeg]',
       // 'image' => 'uploaded[image]|max_size[image,102400]|ext_in[image,jpg,jpeg,png,webp]'

   ];
   if(! $this->validate($rules)){
        return view('/customer/create/');
   }
   else{
   $this->customer->insert($data);

SELECT *
FROM `customers`
WHERE `customers`.`id` = '1'
---
   public function edit($id){
    $data = $this->customer->find($id);

UPDATE `customers` SET `name` = 'khayrul  mizan', `email` = 'rayan@gmail.com', `phone_Number` = '0', `address` = NULL, `state` = 'Dhaka', `created_at` = '', `details` = NULL
WHERE `customers`.`id` IN ('1')
---
   public function update($id){
     $data = [
        'name'=> $this->request->getVar('name'),
        'email'=> $this->request->getVar('email'),
        'phone_Number'=> $this->request->getVar('phone'),
        'address' => $this->request->getVar('address'),
        'state' =>$this->request->getVar('state'),
        'created_at'=>$this->request->getVar('date'),
        'details'  =>$this->request->getVar('subject')
     ];
     $this->customer->update($id,$data);